/*********************************************************************************************************************
 * COPYRIGHT NOTICE
 * Copyright (c) 2019,逐飞科技
 * All rights reserved.
 * 技术讨论QQ群：一群：179029047(已满)  二群：244861897
 *
 * 以下所有内容版权均属逐飞科技所有，未经允许不得用于商业用途，
 * 欢迎各位使用并传播本程序，修改内容时必须保留逐飞科技的版权声明。
 *
 * @file       		main
 * @company	   		成都逐飞科技有限公司
 * @author     		逐飞科技(QQ3184284598)
 * @version    		查看doc内version文件 版本说明
 * @Software 		IAR 8.3 or MDK 5.28
 * @Target core		NXP RT1064DVL6A
 * @Taobao   		https://seekfree.taobao.com/
 * @date       		2019-04-30
 ********************************************************************************************************************/
/*--------------------------------------------------------------*/
/*							头文件加载							*/
/*==============================================================*/
#include "headfile.h"
#include "CAM.h"
#include "data.h"
#include "menu.h"
#include "Init.h"
/*--------------------------------------------------------------*/
/* 							 函数定义 							*/
/*==============================================================*/
int main(void){
/*--------------------------------------------------------------*/
/* 							 变量定义 							*/
/*==============================================================*/
	int time_pass, time_pass1;
/*--------------------------------------------------------------*/
/* 							初始化设置 							*/
/*==============================================================*/
/*----------------------*/
/*	 	 逐飞初始化		*/
/*======================*/
	DisableGlobalIRQ();
    board_init();//务必保留，本函数用于初始化MPU 时钟 调试串口
	pit_init();
	ips200_init();
//	mt9v03x_csi_init();
	//此处编写用户代码(例如：外设初始化代码等)
/*----------------------*/
/*	 	 用户初始化		*/
/*======================*/
//	pit_interrupt_ms(PIT_CH0, 1000);
	Init_para();
	Init_button();
	Init_motor();
	menu_display();
	gpio_init(B11, GPO, 1, GPIO_PIN_CONFIG);
	//总中断最后开启
    EnableGlobalIRQ(0);
/*--------------------------------------------------------------*/
/* 							 循环执行 							*/
/*==============================================================*/	
    while (1){
	//	此处编写需要循环执行的代码
		if(mt9v03x_csi_finish_flag){

		}
    }
}




