/*------------------------------------------------------*/
/* 					   头文件声明 						*/
/*======================================================*/
#ifndef _INIT_H
#define _INIT_H
/*------------------------------------------------------*/
/* 					   头文件调用 						*/
/*======================================================*/
#include "data.h"
/*------------------------------------------------------*/ 
/* 						 宏定义 						*/
/*======================================================*/
//	按键引脚定义
#define KEY1 C10
#define KEY2 C12
#define KEY3 C13
#define KEY4 C14
#define KEY5 C15
#define KEY6 C5
//	电机引脚定义
#define MOTOR_RS PWM2_MODULE1_CHA_C8                   		//右电机 信号引脚
#define MOTOR_RD C9                   						//右电机 方向引脚
#define MOTOR_LS PWM2_MODULE0_CHA_C6                   		//左电机 信号引脚
#define MOTOR_LD C7                   						//左电机 方向引脚
//	舵机引脚定义
#define STEER_PIN PWM4_MODULE2_CHA_C30    
/*------------------------------------------------------*/
/* 					  外部变量声明 						*/
/*======================================================*/
/*----------------------*/
/*	 	 模块名称		*/
/*======================*/

/*------------------------------------------------------*/ 
/* 						函数声明 						*/
/*======================================================*/
void Init_encoder(void);
void Init_motor(void);
char core_select(void);
void code_select(void);
void Init_button(void);
#endif
